---
kind: enumMember
id: F:Autodesk.Revit.DB.ExportColorMode.TrueColorPerView
enum: Autodesk.Revit.DB.ExportColorMode
source: html/20b1158b-d5ab-057d-d780-a4870d0c2a5b.htm
---
# Autodesk.Revit.DB.ExportColorMode.TrueColorPerView

All colors from the Revit project will be exported as 24-bit RGB values as specified in view.